## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.wordpress_ecs_error`            |
|        | `aws_cloudwatch_metric_alarm.wordpress_ecs_error`                 |
| delete | `aws_cloudwatch_log_metric_filter.wordpress_ecs_warn_error_event` |
|        | `aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.wordpress_ecs_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "wordpress_ecs_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/ecs_events"
      + name           = "WordPressEcsError"
      + pattern        = "?Error ?error ?Fatal ?fatal ?Failed ?failed -\"slug=error\""

      + metric_transformation {
          + default_value = "0"
          + name          = "WordPressEcsError"
          + namespace     = "WordPress"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.wordpress_ecs_warn_error_event will be destroyed
  # (because aws_cloudwatch_log_metric_filter.wordpress_ecs_warn_error_event is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "wordpress_ecs_warn_error_event" {
      - id             = "WordPressEcsWarningEvent" -> null
      - log_group_name = "/aws/lambda/ecs_events" -> null
      - name           = "WordPressEcsWarningEvent" -> null
      - pattern        = "?Warn ?Error" -> null

      - metric_transformation {
          - default_value = "0" -> null
          - dimensions    = {} -> null
          - name          = "WordPressEcsWarnErrorEvent" -> null
          - namespace     = "WordPress" -> null
          - unit          = "None" -> null
          - value         = "1" -> null
        }
    }

  # aws_cloudwatch_metric_alarm.wordpress_ecs_error will be created
  + resource "aws_cloudwatch_metric_alarm" "wordpress_ecs_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + alarm_description                     = "WordPress ECS error detected"
      + alarm_name                            = "WordPressEcsError"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WordPressEcsError"
      + namespace                             = "WordPress"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event will be destroyed
  # (because aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "wordpress_ecs_warn_error_event" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ] -> null
      - alarm_description         = "WordPress ECS warning or error event detected" -> null
      - alarm_name                = "WordPressEcsWarnErrorEvent" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:729164266357:alarm:WordPressEcsWarnErrorEvent" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "WordPressEcsWarnErrorEvent" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "WordPressEcsWarningEvent" -> null
      - namespace                 = "WordPress" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.wordpress_ecs_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_response_time_average"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_unhealthy_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_cpu_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_memory_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_aurora_replica_lag"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_ecs_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_failed_login"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch_us_east"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
